import 'level_data.dart';

class XinfaBonus {
  XinfaBonus._();

  static Map<String, double>? getBonus(String xinfaName) {
    return _data[xinfaName];
  }

  static final Map<String, Map<String, double>> _data = {
    '剑气纵横': {
      '最大外功攻击': LevelData.data['金心法外功']!,
      '直接会意率': 2.3,
    },
    '千营一呼': {
      '会心率': LevelData.data['金心法会心']!,
      '外功伤害加成': 2.8,
    },
    '君臣药': {
      '会心率': LevelData.data['金心法会心']!,
      '直接会心率': 4.6,
    },
    '山河绝韵': {
      '会心率': LevelData.data['金心法会心']!,
      '会心伤害加成': 4.4,
    },
    '忘川绝响': {
      '会心率': LevelData.data['金心法会心']!,
      '会心伤害加成': 4.4,
    },
    '扶摇直上': {
      '最小外功攻击': LevelData.data['金心法外功']!,
      '直接会心率': 4.6,
    },
    '无名心法': {
      '最大外功攻击': LevelData.data['金心法外功']!,
      '直接会意率': 2.3,
    },
    '易水歌': {
      '最小外功攻击': LevelData.data['金心法外功']! / 3,
      '最大外功攻击': LevelData.data['金心法外功']! / 3 * 2,
      '直接会心率': 4.6,
    },
    '花上月令': {
      '会心率': LevelData.data['金心法会心']!,
      '会心伤害加成': 4.4,
    },
    '霜天白夜': {
      '最小外功攻击': LevelData.data['金心法外功']!,
      '直接会心率': 4.6,
    },
    '三穷致知': {
      '最小外功攻击': LevelData.data['紫心法外功']! / 3,
      '最大外功攻击': LevelData.data['紫心法外功']! / 3 * 2,
      '外功伤害加成': 2.5,
    },
    '凝神章': {
      '最小外功攻击': LevelData.data['紫心法外功']! / 3,
      '最大外功攻击': LevelData.data['紫心法外功']! / 3 * 2,
      '外功穿透': 5.1,
    },
    '千丝蛊': {
      '最小外功攻击': LevelData.data['紫心法外功']! / 3,
      '最大外功攻击': LevelData.data['紫心法外功']! / 3 * 2,
      '外功治疗加成': 2.5,
    },
    '千山法': {
      '最小鸣金攻击': LevelData.data['紫心法属攻']! / 3,
      '最大鸣金攻击': LevelData.data['紫心法属攻']! / 3 * 2,
      '属攻穿透': 6,
    },
    '大唐歌': {
      '精准率': LevelData.data['紫心法精准']!,
      '会心伤害加成': 4,
    },
    '威猛歌': {
      '会意率': LevelData.data['紫心法会意']!,
      '会意伤害加成': 5.2,
    },
    '孤忠不辞': {
      '会心率': LevelData.data['紫心法会心']!,
      '会心伤害加成': 4,
    },
    '征人归': {
      '最小外功攻击': LevelData.data['紫心法外功']!,
      '外功穿透': 5.1,
    },
    '心弥泥鱼': {
      '最小外功攻击': LevelData.data['紫心法外功']!,
      '外功穿透': 5.1,
    },
    '怒斩马': {},
    '所恨年年': {
      '精准率': LevelData.data['紫心法精准']!,
      '外功伤害加成': 2.5,
    },
    '抗造大法': {
      '最小裂石攻击': LevelData.data['紫心法属攻']! / 3,
      '最大裂石攻击': LevelData.data['紫心法属攻']! / 3 * 2,
      '属攻穿透': 6,
    },
    '擒天势': {
      '会心率': LevelData.data['紫心法会心']!,
      '会心伤害加成': 4,
    },
    '断石之构': {
      '精准率': LevelData.data['紫心法精准']!,
      '直接会心率': 4.1,
    },
    '明晦同尘': {
      '最小外功攻击': LevelData.data['紫心法外功']! / 3,
      '最大外功攻击': LevelData.data['紫心法外功']! / 3 * 2,
      '外功穿透': 5.1,
    },
    '春雷篇': {
      '最小外功攻击': LevelData.data['紫心法外功']! / 3,
      '最大外功攻击': LevelData.data['紫心法外功']! / 3 * 2,
      '外功伤害加成': 2.5,
    },
    '杏花不见': {
      '最小牵丝攻击': LevelData.data['紫心法属攻']!,
      '会心治疗加成': 4,
    },
    '灯儿亮': {
      '最小外功攻击': LevelData.data['紫心法外功']!,
      '外功穿透': 5.1,
    },
    '移经易武': {
      '最大鸣金攻击': LevelData.data['紫心法属攻']!,
      '鸣金伤害加成': 3,
    },
    '穿喉决': {
      '最小裂石攻击': LevelData.data['紫心法属攻']! / 3,
      '最大裂石攻击': LevelData.data['紫心法属攻']! / 3 * 2,
      '属攻穿透': 6,
    },
    '纵地摘星': {
      '最小外功攻击': LevelData.data['紫心法外功']! / 3,
      '最大外功攻击': LevelData.data['紫心法外功']! / 3 * 2,
      '外功穿透': 5.1,
    },
    '绳舟行木': {
      '最小外功攻击': LevelData.data['紫心法外功']!,
      '外功穿透': 5.1,
    },
    '逐狼心经': {
      '会意率': LevelData.data['紫心法会意']!,
      '会意伤害加成': 5.2,
    },
    '极乐泣血': {
      '最大外功攻击': LevelData.data['蓝心法外功']!,
      '会心伤害加成': 3.5,
    },
  };
}
